app/controllers/admin/categories_controller.rb

  def index
    @categories = Category.find(:all, :conditions => "parent_id is null")
---
SELECT * FROM `categories` WHERE (`categories`.parent_id = 3)

  def show
    @category = Category.find(params[:id])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 2)

  def new
    @category = Category.new
    @categories = Category.all
---
SELECT * FROM `categories`

  def edit
    @category = Category.find(params[:id])
    @categories = Category.all
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 4)
SELECT * FROM `categories`

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`, `parent_id`) VALUES('Produce', '2010-06-17 18:53:31', '2010-06-17 18:53:31', NULL)

  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 4)
UPDATE `categories` SET `updated_at` = '2010-06-18 20:43:54', `image_url` = 'http://farm4.static.flickr.com/3155/2411794957_cdf4b1248f_s.jpg' WHERE `id` = 4

  def destroy
    @category = Category.find(params[:id])
    @category.destroy
---
SELECT * FROM `categories` WHERE (`categories`.parent_id = 1)
DELETE FROM `categories` WHERE `id` = 1