app/controllers/admin/delivery_cycles_controller.rb

SELECT * FROM `delivery_cycles` WHERE (edit_open <= '2010-06-19 14:42:40' and delivery_close >= '2010-06-19 14:42:40') LIMIT 1
SELECT * FROM `orders` WHERE (user_id = 2 and delivery_cycle_id = 3) LIMIT 1
---
  def index
    @delivery_cycles = DeliveryCycle.find(:all, :order => 'pickup_close DESC')

SELECT * FROM `delivery_cycles` WHERE (edit_open <= '2010-06-19 14:52:17' and delivery_close >= '2010-06-19 14:52:17') LIMIT 1
---
  def show
    @delivery_cycle = DeliveryCycle.find(params[:id])

SELECT * FROM `delivery_cycles` WHERE (edit_open <= '2010-06-19 14:42:45' and delivery_close >= '2010-06-19 14:42:45') LIMIT 1
---
  def edit
    @delivery_cycle = DeliveryCycle.find(params[:id])

INSERT INTO `delivery_cycles` (`edit_open`, `order_close`, `created_at`, `updated_at`, `delivery_close`, `pickup_open`, `edit_close`, `order_open`, `delivery_open`, `pickup_close`) VALUES('2010-06-20 00:44:00', '2010-06-20 00:44:00', '2010-06-20 01:32:48', '2010-06-20 01:32:48', '2010-06-20 00:44:00', '2010-06-20 01:32:00', '2010-06-20 00:44:00', '2010-06-20 00:44:00', '2010-06-20 00:44:00', '2010-06-20 01:32:00')
---
  def create
    @delivery_cycle = DeliveryCycle.new(params[:delivery_cycle])

    respond_to do |format|
      if @delivery_cycle.save

SELECT * FROM `delivery_cycles` WHERE (edit_open <= '2010-06-19 14:43:18' and delivery_close >= '2010-06-19 14:43:18') LIMIT 1
UPDATE `delivery_cycles` SET `updated_at` = '2010-06-20 18:32:10', `delivery_close` = '2010-06-25 00:44:00', `pickup_open` = '2010-06-26 01:32:00', `delivery_open` = '2010-06-24 00:44:00', `pickup_close` = '2010-06-27 05:32:00', `order_close` = '2010-06-23 00:44:00', `order_open` = '2010-06-22 00:44:00', `edit_close` = '2010-06-21 00:44:00' WHERE `id` = 3
---
  def update
    @delivery_cycle = DeliveryCycle.find(params[:id])

    respond_to do |format|
      if @delivery_cycle.update_attributes(params[:delivery_cycle])

SELECT * FROM `delivery_cycles` WHERE (edit_open <= '2010-06-19 20:42:32' and delivery_close >= '2010-06-19 20:42:32') LIMIT 1
DELETE FROM `delivery_cycles` WHERE `id` = 1
---
  def destroy
    @delivery_cycle = DeliveryCycle.find(params[:id])
    @delivery_cycle.destroy

SELECT * FROM `delivery_cycles` WHERE (edit_open <= '2010-06-20 07:22:45' and pickup_close >= '2010-06-20 07:22:45') LIMIT 1
INSERT INTO `delivery_cycles` (`edit_open`, `order_close`, `created_at`, `updated_at`, `delivery_close`, `pickup_open`, `edit_close`, `order_open`, `delivery_open`, `pickup_close`) VALUES('2010-06-20 05:35:00', '2010-06-20 05:35:00', '2010-06-20 18:20:44', '2010-06-20 18:20:44', '2010-06-20 05:35:00', '2018-05-09 05:35:00', '2010-06-20 05:35:00', '2010-06-20 05:35:00', '2010-06-20 05:35:00', '2057-10-11 05:35:00')
---
  def duplicate
    start_date = DateTime.civil(params[:delivery_cycle][:"start_date(1i)"].to_i,
                                params[:delivery_cycle][:"start_date(2i)"].to_i,
                                params[:delivery_cycle][:"start_date(3i)"].to_i,
                                params[:delivery_cycle][:"start_date(4i)"].to_i,
                                params[:delivery_cycle][:"start_date(5i)"].to_i)
    logger.debug("start_date is #{start_date}")
    start_date = start_date + 4.hours
    dc = DeliveryCycle.find(params[:id])
    logger.debug("dc is #{dc.inspect}")
    logger.debug("edit open is #{start_date}")
    logger.debug("start_date is #{start_date}, edit open is #{dc.edit_open}, edit close is #{dc.edit_close}")
    logger.debug("dc.edit_close - dc.edit_open is #{dc.edit_close - dc.edit_open}")
    logger.debug("start_date + 86400 is #{start_date + 86400}, start_date + 86400/(60*60) is #{start_date + (86400/(60*60))}")
    logger.debug("edit close is #{start_date + (dc.edit_close     - dc.edit_open)}")
    logger.debug("start_date is #{start_date}, edit open is #{dc.edit_open}")
    logger.debug("order open is #{start_date + (dc.order_open - dc.edit_open)}")
    logger.debug("start_date is #{start_date}, edit open is #{dc.edit_open}")
    new_dc = DeliveryCycle.new(:edit_open      => start_date,
                               :edit_close     => start_date + ((dc.edit_close     - dc.edit_open) / 86400),
                               :order_open     => start_date + ((dc.order_open     - dc.edit_open) / 86400),
                               :order_close    => start_date + ((dc.order_close    - dc.edit_open) / 86400),
                               :delivery_open  => start_date + ((dc.delivery_open  - dc.edit_open) / 86400),
                               :delivery_close => start_date + ((dc.delivery_close - dc.edit_open) / 86400),
                               :pickup_open    => start_date + ((dc.pickup_open    - dc.edit_open) / 86400),
                               :pickup_close   => start_date + ((dc.pickup_close   - dc.edit_open) / 86400))

    respond_to do |format|
       if new_dc.save