app/controllers/admin/home_controller.rb

SELECT * FROM `delivery_cycles` WHERE (edit_open <= '2010-06-19 14:42:38' and delivery_close >= '2010-06-19 14:42:38') LIMIT 1
SELECT * FROM `orders` WHERE (user_id = 2 and delivery_cycle_id = 3) LIMIT 1
---
  def index
    @delivery_cycles = DeliveryCycle.find(:all,
                                          :conditions => ["order_close <= ?", Time.now],
                                          :order => "order_close DESC")