app/controllers/admin/producer_account_requests_controller.rb

  def deny
    @par = ProducerAccountRequest.find(params[:id])
    @par.update_attributes(:status => "Denied", :status_changed_at => Time.now)
---
SELECT * FROM `producer_account_requests` WHERE (`producer_account_requests`.`id` = 2)
UPDATE `producer_account_requests` SET `updated_at` = '2010-06-17 15:42:27', `status_changed_at` = '2010-06-17 15:42:27', `status` = 'Denied' WHERE `id` = 2

  def approve
    @par = ProducerAccountRequest.find(params[:id])
    @account = Account.new(:user_id => @par.user_id)
    ProducerAccountRequest.transaction do
      @account.save
      @par.update_attributes(:status => "Approved", :status_changed_at => Time.now)
---
SELECT * FROM `producer_account_requests` WHERE (`producer_account_requests`.`id` = 3)
INSERT INTO `accounts` (`city`, `created_at`, `zipcode`, `updated_at`, `website_url`, `producer_name`, `street`, `user_id`, `phone`, `logo_url`, `description`, `state`) VALUES(NULL, '2010-06-18 20:05:19', NULL, '2010-06-18 20:05:19', NULL, NULL, NULL, 3, NULL, NULL, NULL, NULL)
UPDATE `producer_account_requests` SET `updated_at` = '2010-06-17 15:42:50', `status_changed_at` = '2010-06-17 15:42:50', `status` = 'Approved' WHERE `id` = 3
UPDATE `users` SET `updated_at` = '2010-06-17 15:42:50', `perishable_token` = '10gaUfMuHjWhS5Oprtzi', `last_request_at` = '2010-06-17 15:42:50' WHERE `id` = 2