app/controllers/admin/users_controller.rb

  def index
    @users = User.find(:all, :order => 'last_name ASC, first_name ASC')
---
SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1