app/controllers/admin/users_controller.rb

SELECT * FROM `users`
---
  def index
    @users = User.all