app/controllers/accounts_controller.rb

SELECT * FROM `accounts` WHERE (`accounts`.user_id = 2) LIMIT 1
---
  def index
    @accounts = Account.all

SELECT * FROM `accounts` WHERE (`accounts`.user_id = 2) LIMIT 1
---
  def show
    @account = Account.find(params[:id])

SELECT * FROM `accounts` WHERE (`accounts`.user_id = 2) LIMIT 1
---
  def edit
    @account = Account.find(params[:id])

SELECT * FROM `accounts` WHERE (`accounts`.user_id = 2) LIMIT 1
UPDATE `accounts` SET `phone` = '', `updated_at` = '2010-06-19 18:56:22', `website_url` = '', `producer_name` = 'Leila\'s Yummy Yums', `city` = 'Burlington', `street` = '', `zipcode` = '00000', `state` = 'NC', `description` = 'Oooh my yummy yums are so yummy. ' WHERE `id` = 8
---
  def update
    @account = Account.find(params[:id])

    respond_to do |format|
      if @account.update_attributes(params[:account])

SELECT * FROM `accounts` WHERE (`accounts`.`id` = 7)
SELECT * FROM `users` WHERE (`users`.`login` = 'enoriverfm') LIMIT 1
INSERT INTO `account_memberships` (`created_at`, `updated_at`, `account_id`, `user_id`) VALUES('2010-06-18 04:38:52', '2010-06-18 04:38:52', 7, 3)
UPDATE `users` SET `updated_at` = '2010-06-18 04:38:51', `perishable_token` = 'kwh0uXIeIhvntNmprwf4', `last_request_at` = '2010-06-18 04:38:51' WHERE `id` = 2
---
  def add_member
    @account = Account.find(params[:id])
    if params[:user] and params[:user][:login]
      @user = User.find_by_login(params[:user][:login])
    end
    if @user
      am = AccountMembership.create(:user => @user, :account => @account)
    end
    if am.save

SELECT * FROM `accounts` WHERE (`accounts`.`id` = 7)
SELECT * FROM `account_memberships` WHERE (`account_memberships`.`user_id` = '3' AND `account_memberships`.`account_id` = 7) LIMIT 1
DELETE FROM `account_memberships` WHERE `id` = 2
---
  def remove_member
    @account = Account.find(params[:id])
    if params[:user_id]
      @am = AccountMembership.find(:first, :conditions => {:account_id => @account.id, :user_id => params[:user_id]})
    end
    if @am
      @am.destroy