app/controllers/application_controller.rb

SELECT * FROM `accounts` WHERE (`accounts`.user_id = 2)
---
    def load_sidebar_variables
      @sidebar_producers = Account.find(:all, :order => "producer_name ASC")