app/controllers/orders_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1
SELECT * FROM `delivery_cycles` WHERE (edit_open <= '2010-06-20 22:09:10' and pickup_close > '2010-06-20 22:09:10') LIMIT 1
SELECT * FROM `orders` WHERE (user_id = 2 and delivery_cycle_id = 3) LIMIT 1
---
  def index
    @user = User.find(params[:user_id]) if params[:user_id]
    @delivery_cycle = DeliveryCycle.find(params[:delivery_cycle_id]) if params[:delivery_cycle_id]
    if @user
      @orders = @user.orders

SELECT * FROM `orders` WHERE (user_id = 2 and delivery_cycle_id = 3) LIMIT 1
---
  def show
    @order = Order.find(params[:id])

SELECT * FROM `orders` WHERE (user_id = 2 and delivery_cycle_id = 3) LIMIT 1
---
  def terms
    @order = Order.find(params[:id])

SELECT * FROM `orders` WHERE (`orders`.`id` = 1)
UPDATE `orders` SET `updated_at` = '2010-06-23 00:23:24', `final` = 1 WHERE `id` = 1
---
  def finalize
    @order = Order.find(params[:id])
    @order.final = true
    if @order.save

SELECT * FROM `orders` WHERE (user_id = 2 and delivery_cycle_id = 3) LIMIT 1
---
  def invoice
    @order = Order.find(params[:id])