app/controllers/password_resets_controller.rb

  def create
    @user = User.find_by_email(params[:email])
---
SELECT * FROM `users` WHERE (`users`.`email` = 'rebeccanesson@gmail.com') LIMIT 1

  def update
    @user.password = params[:user][:password]
    @user.password_confirmation = params[:user][:password_confirmation]
    if @user.save
---
UPDATE `users` SET `failed_login_count` = 0, `updated_at` = '2010-06-18 04:01:28', `crypted_password` = 'db10b429772cce01431cc169e201b1cc9186ee1c20e568b01a7d4ba9397e660ef77e9c86e227b2ae3cbcd5710028762f1306696c501a386e7c770b159d70db13', `perishable_token` = 'oOOqs-Vk7pT4ep4wArK-', `last_login_at` = '2010-06-16 20:05:02', `current_login_at` = '2010-06-18 04:01:28', `password_salt` = '242auf-Pf4vQUrdifpYN', `login_count` = 12, `persistence_token` = '282fa0b2fe35aeaac4304607e79207006370e82d084520c8961479d465219b9ccf4df7c3cb45f373ce2d14ae11a60edd0e3cf1d39d7213a039e27deda88b22c0', `last_request_at` = '2010-06-18 04:01:28' WHERE `id` = 2

  def load_user_using_perishable_token
    @user = User.find_using_perishable_token(params[:id])
---
SELECT * FROM `users` WHERE (perishable_token = 'gbyK75k9JwAIGoeAe9c3' and updated_at > '2010-06-18 03:51:28') LIMIT 1