app/controllers/products_controller.rb

  def index
    @search = Product.search(params[:search])
    @products = @search.all
    @facets = Product.facet(@products)
    @root_categories = Category.root_categories

    if params[:account_id]
      @account = Account.find(params[:account_id])
---
SELECT * FROM `products` WHERE (products.category_id = 3 OR products.category_id = 6 OR products.category_id = 8 OR products.category_id = 9 OR products.category_id = 7)
SELECT * FROM `accounts` WHERE (`accounts`.user_id = 2)

  def new
    @product = Product.new
    @product.account = @account
    @categories = Category.all
---
SELECT * FROM `categories` WHERE (`categories`.parent_id = 3)

  def edit
    @categories = Category.all
---
SELECT * FROM `categories` WHERE (`categories`.parent_id = 3)

  def create
    @product = Product.new(params[:product])
    @product.account = @account
    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`created_at`, `image_url`, `title`, `updated_at`, `account_id`, `ordering_unit`, `description`, `price_per_unit`) VALUES('2010-06-17 18:13:31', '', 'Beautiful Ruby Code', '2010-06-17 18:13:31', 7, 'one model', 'the greatest online ordering site ever', 100)

  def update
    respond_to do |format|
      if @product.update_attributes(params[:product])
---
UPDATE `products` SET `updated_at` = '2010-06-18 01:18:59', `category_id` = 3, `image_url` = 'http://farm5.static.flickr.com/4070/4707993206_73c749e3b6_s.jpg' WHERE `id` = 1

  def make_orderable
    number = params[:number].to_i
    number.times do |i|
      break unless @current_delivery_cycle
      o = Orderable.create(:product_id => @product.id, :status => 'Available', :delivery_cycle_id => @current_delivery_cycle.id)
---
INSERT INTO `orderables` (`created_at`, `product_id`, `updated_at`, `line_item_id`, `status`, `delivery_cycle_id`) VALUES('2010-06-22 03:03:50', 1, '2010-06-22 03:03:50', NULL, 'Available', 3)

  def remove_orderable
    number = params[:number].to_i
    if number and number > 0
      number.times do |i|
        break unless @current_delivery_cycle
        o = Orderable.find(:first, :conditions => 'status = "Available"', :delivery_cycle_id => @current_delivery_cycle.id)
        if o
          o.destroy
---
SELECT * FROM `orderables` WHERE (status = "Available") LIMIT 1
DELETE FROM `orderables` WHERE `id` = 1

  def load_product
    @product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 7)

  def load_account
    @account = nil
    @account = Account.find(params[:account_id]) if (params[:account_id])
---
SELECT * FROM `accounts` WHERE (`accounts`.user_id = 2)