app/controllers/users_controller.rb

INSERT INTO `users` (`city`, `single_access_token`, `last_request_at`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `zipcode`, `admin`, `failed_login_count`, `current_login_ip`, `street`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_name`, `phone`, `last_login_ip`, `login`, `last_login_at`, `email`, `first_name`, `state`) VALUES('Small Town', '32mqVZbDQDZHn4gbWXjo', '2010-06-18 03:31:12', '2010-06-18 03:31:12', '326c3ffa032ffb93361c470a77a68d85d0b5ef772e19ba96183984111c9ec94f2170ab798bc3e842a402a5bac6a5ef0accdcfc33961af131cc0ec4c0be7c78e1', '9ofAh2a49Hf7j_3OEji0', '2010-06-18 03:31:12', '00000', 0, 0, '127.0.0.1', '1 One Street', 'QV8coSXIGZnYZ989g-Sd', '2010-06-18 03:31:12', 'a9fcb095114a213d0af8e9e80672531f71f7783ce48d24270243305a3d1745dc3348ffc91bc544c030c1d4fedc10c54e25287a524b4d39ba50bba80c13c6c8b6', 1, 'Nesson', '', NULL, 'enoriverfm', NULL, 'rebecca@prx.org', 'Leila', 'NC')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
SELECT * FROM `delivery_cycles` WHERE (edit_open <= '2010-06-18 22:25:26' and delivery_close >= '2010-06-18 22:25:26') LIMIT 1
SELECT * FROM `orders` WHERE (user_id = 2 and delivery_cycle_id = 3) LIMIT 1
---
  def show
    @user = User.find(params[:id])
    @delivery_cycles = DeliveryCycle.find(:all,
                                          :conditions => ["order_close <= ?", Time.now],
                                          :order => "order_close DESC")

SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1
---
  def edit
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1
UPDATE `users` SET `updated_at` = '2010-06-16 20:04:47', `crypted_password` = '8053fadecc6727aa53a522d6652ba431b73c7a86f107c163bc17050620ce1c9adc8a8f84d118a2a6cd7962af8d502fd90f8ce6098dbdefd47be64084a14d140c', `perishable_token` = 'zIG4PnBGvGyD97B3xJ7y', `last_login_at` = '2010-06-16 19:30:30', `current_login_at` = '2010-06-16 20:04:47', `password_salt` = 'M4TTtD74gt7NuegX6RYj', `login_count` = 10, `persistence_token` = '75da20f518fdf04827286b63fb9fc4b8ba0d5645ef5afbc594d454b5b95a78c8060959daabcb99ed3f6a3321b3974c6eef9b448c0375aaac4fb22b8c65e0473c', `last_request_at` = '2010-06-16 20:04:47' WHERE `id` = 2
---
  def update
    @user = User.find(params[:id]) # makes our views "cleaner" and more consistent
    if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1
---
  def request_producer_account
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1
SELECT * FROM `products` WHERE (`products`.`id` = 1)
SELECT * FROM `orderables` WHERE (`orderables`.product_id = 1 AND (status='Available')) LIMIT 1
SELECT * FROM `orders` WHERE (user_id = 2 and delivery_cycle_id = 3) LIMIT 1
INSERT INTO `orders` (`created_at`, `final`, `updated_at`, `user_id`, `delivery_cycle_id`) VALUES('2010-06-21 02:08:49', NULL, '2010-06-21 02:08:49', 2, 3)
INSERT INTO `line_items` (`created_at`, `product_id`, `order_id`, `updated_at`) VALUES('2010-06-22 03:10:28', NULL, 1, '2010-06-22 03:10:28')
UPDATE `orderables` SET `updated_at` = '2010-06-22 03:23:05', `line_item_id` = 3, `status` = 'In Cart' WHERE `id` = 111
---
  def add_to_cart
    success = false
    @user = User.find(params[:id])
    @product = Product.find(params[:product_id])
    @orderable = @product.available_orderables_in_cycle(@current_delivery_cycle).first
    if @orderable
      @order = @user.current_order
      if !@order
        @order = Order.create(:user_id => @user.id, :delivery_cycle => @current_delivery_cycle)
      end
      if @order
        @line_item = @order.line_item_for_product(@product) || LineItem.create(:order_id => @order.id, :product_id => @product.id)
        if @line_item.save
          @orderable.update_attributes(:status => 'In Cart', :line_item_id => @line_item.id)

SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1
SELECT * FROM `line_items` WHERE (`line_items`.`id` = 3)
SELECT * FROM `orderables` WHERE (`orderables`.line_item_id = 3) LIMIT 1
SELECT * FROM `orders` WHERE (user_id = 2 and delivery_cycle_id = 3) LIMIT 1
SELECT count(*) AS count_all FROM `orderables` WHERE (`orderables`.line_item_id = 3)
UPDATE `orderables` SET `updated_at` = '2010-06-22 03:50:28', `line_item_id` = NULL, `status` = 'Available' WHERE `id` = 111
---
  def remove_from_cart
    result = false
    @user = User.find(params[:id])
    @line_item = LineItem.find(params[:line_item_id])
    if @line_item and @line_item.orderables.size > 0
      @orderable = @line_item.orderables.first
      @orderable.update_attributes(:status => 'Available', :line_item_id => nil)